{
    "1":{
        "AIRLINE SPECIFIC": " Cannot determine at the time of departure: Further explanation and new MVT needed within 120 minutes of ATD, which is sent by ground handling"
        
        
    },
    "2a":{
        "Use of Airstarter":" Use of air starter in case of aircraft’s APU is INOP. Code to be used up to 10 mins, if more time needed use code 39.Not to be used in case of air starter unit not ready on stand when required"
    },
    "2b":{
        "Manual start of engine":" Ramp agent will be advised by Flight Crew"
    },
    "2c":{
        "Cargo Door manual operation":" In case of aircraft’s cargo door automated operation is INOP, flight crew shall open/close the cargo doors which may cause delays in off/onloading"
    },
    "2d":{
        "Application of Operational (O and M) MEL procedures":" Certain deferred maintenance item requires additional checks/actions (O and M) by the flight crew which may extend the time needed for departure. If such case exists Flight crew will advise the subcode to ramp agent. Not to be used at he first occasion of aircraft defect; in this case code 41 must be used"
    },
    "3a":{
        "Late passenger to gate actually travelling":" Passengers travelling were late at the boarding"
    },
    "3b":{
        "Passengers were offloaded with their bags":" Missing passenger offloaded with their bags"
    },
    "3c":{
        "Passenger offloaded without bags":" Missing passenger offloaded without bags, though initially baggage tracing was initiated"
    },
    "4":{
        "PASSENGER COACHES":" Regardless of whether the coaches are provided by the handling agent or the airport authority"
    },
    "4a":{
        "Shortage":" Not enough buses"
    },
    "4b":{
        "Late":" Buses were late for dis/embarkation"
    },
    "4c":{
        "Late Apron Crew Transport":" Crew was late at the aircraft due to late apron transport despite been ordered /advised in advance"
    },
    "5":{
        "WHEELCHAIRS":" Handling etc (for late ambulift or wheelchair use code 34D or 34E with Supplementary Info / SI remark)"
    },
    "6":{
        "NO GATE/STAND AVAILABLE":" No gate/stand available at the airport"
    },
    "7":{
        "OFFLOADING OF UNRULY PASSENGER":" Delays incurred due to Police attending the inbound flight which delays the outbound sector. Delays accumulated for the handling of unruly passenger including ramp return, refueling, etc."
    },
    "7a":{
        "Inbound":" Unruly passenger was on inbound flight which affected outbound leg as well"
    },
    "7b":{
        "Outbound":" Unruly passenger was on outbound flight which affected departure"
    },
    "8":{
        "AIRPORT SLOT DISCREPANCIES":" (e.g late airport slot allocated)"
    },
    "9":{
        "SCHEDULED GROUND TIME LESS THAN DECLARED MINIMUM GROUND TIME":" In any case when scheduled Turnaround time cannot be met due to the reasons below"
    },
    "9a":{
        "Crew Passport control":" Regular Crew passport control takes more time than needed"
    },
    "9b":{
        "Delayed First wave departures B (extended ground time for night cleaning, catering change, etc..)":" In case of operational decision from Wizz Air OPS"
    },
    "9c":{
        "Insufficient Ground Time for aircraft rotation (less than 25 mins)":" Scheduling discrepancy"
    },
    "9d":{
        "Contracted Turn Around Time is less than declared minimum":" Scheduling discrepancy"
    },
    "10":{
        "WEB CHECK-IN":" Discrepancies / errors faced during check-in or boarding"
    },
    "10a":{
        "Web boarding pass error":" In case of web boarding pass error occurs"
    },
    "10b":{
        "Web check-in passenger excess bag":" In case of several web check-in passenger(s) hand bags are charged at the gate, which cause delay"
    },
    "11":{
        "LATE CHECK-IN":" Acceptance after deadline"
    },
    "12":{
        "LATE CHECK-IN":" Congestion in check-in area"
    },
    "12a":{
        "Congestion in spite of all check-in counters open":" Congestion in check-in area due to insufficient space available"
    },
    "12b":{
        "Congestion due to insufficient check-in counters open / Lack of staff":" Congestion due to insufficient check-in counters open / Lack of staff"
    },
    "13":{
        "CHECK-IN ERROR":" Check-in error of passenger and baggage"
    },
    "13a":{
        "Web related check-in error":" Handling should advise responsible Ground operations Manager as soon as flight departed"
    },
    "13b":{
        "Check-in error by handling agent":" Error/fault done by handling agent’s staff"
    },
    "14":{
        "OVERSALES":" Booking error, more seats sold than available"
    },
    "15":{
        "BOARDING":" Discrepancies during boarding"
    },
    "15a":{
        "Late boarding by gate staff":" Aircraft was ready for passengers but handling staff stated it later"
    },
    "15b":{
        "Slow boarding by gate staff":" Embarkation started on time but passengers were not boarded fast enough. Slow acceptance at the gat"
    },
    "16":{
        "MEDICAL EMERGENCY, PASSENGER CONVENIENCE":" To be used in case of medical emergency of passenger convenience caused delay"
    },
    "16a":{
        "Passenger medical emergency":" Code to be advised by flight crew if in relation to boarded passenger. If passenger was not boarded yet handling shall advise Flight Crew"
    },
    "16b":{
        "Crew medical emergency":" Code to be advised by flight crew"
    },
    "16c":{
        "Handling staff medical emergency":" Handling shall advise Flight Crew"
    },
    "16d":{
        "Passenger convenience":" Code to be advised by flight crew if in relation to boarded passenger. If passenger was not boarded yet handling shall advise Flight Crew"
    },
    "16e":{
        "Press, PR events - airline":" If event was organized by Wizz Air"
    },
    "16f":{
        "Press, PR events - airport":" If event was organized by airport/handling. Wizz Air OPS shall be notified of such event in advance"
    },
    "16g":{
        "Other":" Explanation needed"
    },
    "18":{
        "BAGGAGE PROCESSING":" Applies to breakdown of airport baggage system only"
    },
    "18a":{
        "Waiting for bags after baggage system breakdown":" If system breakdown is temporary and bags cannot be put on baggage carts despite check-in closure was on time"
    },
    "18b":{
        "Late check-in closure due to baggage system breakdown":" Passengers are unable to check-in due to baggage system breakdown"
    },
    "30":{
        "LOADING/UNLOADING":" Cabin Baggage"
    },
    "30a":{
        "Excessive hand baggage":" Cabin baggage becomes hold baggage due to being outsized and baggage category changed at the gate"
    },
    "30b":{
        "“Delivery at Aircraft”":" Baby stroller, wheelchair, items handed over at the aircraft"
    },
    "31":{
        "AIRCRAFT DOCUMENTATION":" Late / inaccurate"
    },
    "31a":{
        "Ramp supervision":" Fault of ramp agent, e.g improper or lack of communication, wrong info, etc."
    },
    "31b":{
        "Weight and balance by handling – loadsheet":" Load sheet problems: late, improper, manual loadsheet in case of EDP system breakdown, etc."
    },
    "31c":{
        "Weight and balance by handling – loading instruction":" Loading instruction discrepancies: late, improper, etc."
    },
    "31d":{
        "Passenger related information":" List of extra services, passenger manifest, etc.. late or inaccurate which caused discrepancies on board"
    },
    "31e":{
        "Repositioning of deadload for balance reasons":" Improper balance position and deadload shall be repositioned"
    },
    "31f":{
        "Weight and balance by flight crew":" Weight and balance done by flight crew in case of improper handling activity"
    },
    "31g":{
        "Weather information provided by Ramp agent":" Late or inaccurate (too “old”, not the requested stations, etc.)"
    },
    "31h":{
        "Flight Plan provided by Ramp agent": " Late or inaccurate (too “old”, not the requested stations, etc.)"
    },
    "32":{
        "LOADING/UNLOADING": " Hold Baggage"
    },
    "32a":{
        "Lack of loading staff":" Delay caused by lack of loading staff (late at the aircraft)"
    },
    "32b":{
        "Wrong bag count":" Delay caused by handling agent's wrong bag count"
    },
    "32c":{
        "Not controllable e.g. bulky loads":" Delay caused by the uncontrollable bulky loads - e.g. too many sport equipment, etc."
    },
    "33":{
        "LOADING EQUIPMENT":" Lack of or breakdown of ground servicing equipment, Late at the aircraft"
    },
    "33a":{
        "Lack of":" Delay caused by lack of loading equipment"
    },
    "33b":{
        "Breakdown":" Delay caused by breakdown of loading equipment"
    },
    "33c":{
        "Late at the aircraft":" Delay caused by late arrival of loading equipment to the aircraft"
    },
    "34":{
        "SERVICING EQUIPMENT":" Lack of or breakdown of ground servicing equipment, Late at the aircraft"
    },
    "34a":{
        "Steps":" Delay caused by late, lack of or breakdown of steps. In case of jetbridge use 87C"
    },
    "34b":{
        "Water service":" Delay caused by late, lack of or breakdown of water service"
    },
    "34c":{
        "Toilet service":" Delay caused by late, lack of or breakdown of toilet service"
    },
    "34d":{
        "Ambulift":" Delay caused by late, lack of or breakdown of ambulift"
    },
    "34e":{
        "Wheelchair":" Delay caused by late, lack of or breakdown of manual wheelchair-moving equipment. (e.g pax manually taken to the aircraft and no special carry-on chair is available, etc..)"
    },
    "34f":{
        "Repositioning of steps":" In case of incorrectly positioned steps"
    },
    "34g":{
        "Other":" Explanation needed from Handling agent to responsible Ground Operations Manager"
    },
    "35":{
        "AIRCRAFT CLEANING":" Code not to be used for cleaning done by the cabin crew (code 68)"
    },
    "35a":{
        "Late compilation of scheduled cleaning":" Delay caused by the late compilation of scheduled cleaning"
    },
    "35b":{
        "Extra cleaning requested due to improper initial cleaning":" Extra cleaning requested by crew due to improper initial cleaning"
    },
    "35c":{
        "Extra cleaning requested due to other":" Extra cleaning requested by crew due to sick passenger or other reason when cleaning cannot be performed with the means available on-board"
    },
    "36":{
        "FUELLING/DEFUELLING":" Fault of fuel supplier"
    },
    "36a":{
        "Lack of equipment":" Delay caused by lack of fuelling equipment (tanker, steps, etc...)"
    },
    "36b":{
        "Breakdown":"Delay caused by breakdown of fuelling equipment"
    },
    "36c":{
        "Late at the aircraft":" Delay caused by late availability of fuel (late at the aircraft, late connection to the aircraft, etc...)"
    },
    "36d":{
        "New truck required":" New fuel truck needed due to current one’s capacity is insufficient"
    },
    "36e":{
        "Defuelling":" In case of defueling needed due to fueller’s fault"
    },
    "37":{
        "CATERING":" Late delivery or loading"
    },
    "37a":{
        "Late compilation – schedule":" Late compilation of scheduled delivery or loading"
    },
    "38b":{
        "Extra uplift":" Extra uplift requested by WIZZ OPS (if crew requests code 68 shall be used)"
    },
    "37c":{
        "Late compilation – ground time":" Late compilation of scheduled delivery or loading due to insufficient ground time"
    },
    "39":{
        "TECHNICAL EQUIPMENT":" Lack of or breakdown of technical equipment, late at the aircraft"
    },
    "39a":{
        "Pushback, towing, towbar":" Explanation needed from Handling agent to responsible Ground Operations Manager"
    },
    "39b":{
        "GPU":" Explanation needed from Handling agent to responsible Ground Operations Manager" 
    },
    "39c":{
        "Air starter":" Explanation needed from Handling agent to responsible Ground Operations Manager"
    },
    "39d":{
        "De-icing":" Explanation needed from Handling agent to responsible Ground Operations Manager"
    },
    "39e":{
        "Air conditioning":" Explanation needed from Handling agent to responsible Ground Operations Manager"
    },
    "39f":{
        "Other":" Explanation needed from Handling agent to responsible Ground Operations Manager"
    },
    "41":{
        "AIRCRAFT DEFECTS":" Aircraft defects identified on site"
    },
    "42":{
        "SCHEDULED MAINTENANCE, late release":" Late release from scheduled maintenance"
    },
    "42a":{
        "Short ground time - technical":" Short ground time - unable to perform the scheduled check due to planned technical ground time"
    },
    "42b":{
        "Maintenance error":" MX provider was unable to hand over the aircraft on time due their fault"
    },
    "43":{
        "NON-SCHEDULED MAINTENANCE":" Special checks and/or additional works beyond normal maintenance schedule (not to be used for checks required by code 51-52 reasons)"
    },
    "43a":{
        "Lack of local staff – non mx":" For non-maintenance stations where staff has to be sent from other location"
    },
    "43b":{
        "Lack of staff – mx":" Maintenance stations with lack of manpower"
    },
    "44":{
        "SPARES AND MAINTENANCE EQUIPMENT":" Lack of spares or breakdown maintenance equipment"
    },
    "44a":{
        "Lack of spares":" No spares available"
    },
    "44b":{
        "Lack of/breakdown of maintenance equipment":" Delay caused by lack of/breakdown of maintenance equipment"
    },
    "44c":{
        "Late delivery of spare(s)":" Spare parts were ordered but delivery was late"
    },
    "45":{
        "AOG SPARES TO BE CARRIED TO OTHER STATIONS":" AOG spare parts to be carried to another station"  
    },
    "45a":{
        "Late delivery to the aircraft":" Delay caused by late delivery of AOG spares to the aircraft"
    },
    "45b":{
        "Late documentation":" Delay caused by late receipt of documentation of AOG spares, which delayed the release of the aircraft back to service"
    },
    "45c":{
        "Incorrect documentation":" Delay caused by incorrect documentation of AOG spare parts, which delayed the release of the aircraft back to service"
    },
    "46":{
        "AIRCRAFT CHANGE – technical":" AIRCRAFT CHANGE for technical reasons only – others see 51H or 52L"
    },
    "46a":{
        "First recovery flight only":" To be used for first recovery flight only. (after code 41-43) Any other flight concerned: see 90F"
    },
    "51":{
        "DAMAGE DURING FLIGHT OPERATIONS":" Any damage while aircraft moves under own engine power"
    },
    "51a":{
        "Bird strike":" Damage caused by Bird strike"
    },
    "51b":{
        "Lightning strike":" Damage caused by Lightning strike"
    },
    "51c":{
        "Hard of overweight landing":" Damage caused by hard of overweight landing"
    },
    "51d":{
        "Severe weather conditions / Turbulence":" Damage caused by Severe weather conditions / Turbulence"
    },
    "51e":{
        "Collision during taxi":" Damage caused by collision during taxi"
    },
    "51f":{
        "FOD damage":" Foreign Object Damage during taxi (Tire) or cargo compartment contamination (Spillage)"
    },
    "51g":{
        "Maintenance and/or aircraft change after damage during flight operations":" Maintenance and/or aircraft change after damage during flight operations (e.g. wheel change caused by FOD during taxiing, mandatory Bird strike inspection after Bird strike)"
    },
    "51h":{
        "Other (explanation needed)":" None of the cases above, detailed explanation needed"
    },
    "52":{
        "DAMAGE DURING GROUND OPERATIONS":" Any damage during ground operations when aircraft is dispatched from the ground"
    },
    "52a":{
        "Collision":" Collision other than taxi"
    },
    "52b":{
        "Push back, towing":" Damage caused by pushback equipment or during push back/towing"
    },
    "52c":{
        "Loading equipment":" Damage caused by loading equipment: belt loader, baggage truck/trolley, etc."
    },
    "52d":{
        "Air bridge":" Damage caused by air bridge"
    },
    "52e":{
        "Steps":" Damage caused by steps (improper positioning, step failure, etc.)"
    },
    "52f":{
        "Fuel equipment":" Damage caused by fuelling equipment (improper positioning, failure, etc.)"
    },
    "52g":{
        "Technical support equipment":" Damage caused by GPU, ASU, ACU, water/waste truck, etc... other than listed above"
    },
    "52h":{
        "Catering equipment":" Damage caused by catering equipment, e.g. during loading/un-loading, etc."
    },
    "52i":{
        "Contamination, adverse weather":" Damage caused by contamination on the stands or in compartments. Damage caused by adverse weather"
    },
    "52j":{
        "Maintenance and/or aircraft change during ground operations":" Maintenance and/or aircraft change after damage during ground operations"
    },
    "52k":{
        "Accidental slide deployment":" Accidental escape slide deployment done by ground handling/maintenance staff. Use code 68 if done by flight crew"
    },
    "52l":{
        "Other":" None of the cases above, detailed explanation needed"
    },
    "55":{
        "DEPARTURE CONTROL":" Failure of Departure Control System (DCS)"
    },
    "55a":{
        "Own system":" Wizz Air’s own system failure"
    },
    "55b":{
        "Other system":" Failure of DCS system other than provided by Wizz Air"
    },
    "56":{
        "CARGO PREPARATION/DOCUMENTATION":""
    },
    "56a":{
        "Local equipment failure":" In case of flight delayed due to time needed for handling special request of Wizz Air – urgent CO-Mail handling, etc."
    },
    "57":{
        "FLIGHT PLANS":" In case of flight delayed due to time needed to flight plan delivered to cockpit"
    },
    "57a":{
        "Local equipment failure":" Wizz Air’s own local equipment’s failure"
    },
    "58":{
        "OTHER AUTOMATED EQUIPMENT FAILURE":" Other automated system’s failure, none of the above cases"
    },
    "59":{
        "TABLET PC, LACK OF ONBOARD DOCUMENTATION":" In case of Tablet PCs’ breakdown/malfunction; or if any airline operations’ related information causes delay"
    },
    "60":{
        "LATE DEPARTURE PROCEDURE":" Delay caused by late departure procedure. Seek advice from Flight Crew"
    },
    "60a":{
        "Additional briefing":" Additional briefing needed for performance verification"
    },
    "60b":{
        "Additional checks":" Additional checks needed: e.g. headcount, door, slide, etc."
    },
    "60c":{
        "Lack of space for accepted hand baggage":" Passengers slow to settle/embark/disembark due to lack of space for accepted hand baggage. (e.g. too many clothes of passengers at winter season)"
    },
    "60d":{
        "Incorrect parking position":" Pilot’s fault (re-positioning of aircraft etc... due to improper parking of the aircraft)"
    },
    "60e":{
        "Other":" None of the above cases, detailed explanation needed"
    },
    "61":{
        "FLIGHT PLAN":" Late compilation or change of flight documentation"
    },
    "62":{
        "OPERATIONAL REQUIREMENTS":""
    },
    "62a":{
        "Fuel":" In case of significant amounts of fuel to be uplifted"
    },
    "62b":{
        "Load alteration":" Delay caused by load alteration requested by Flight Crew or Wizz Air OPS"
    },
    "62c":{
        "Hot brakes":" In case of brake failure. (code 2D to be used in case of brake cooling off period)"
    },
    "62d":{
        "Other":" None of the cases above, explanation needed"
    },
    "63":{
        "LATE CREW BOARDING":" Late crew boarding for other reason than connection"
    },
    "63a":{
        "Flight deck (pilots)":" Pilot’s late boarding"
    },
    "63b":{
        "Full crew":" Late boarding of full flight crew (cabin and cockpit)"
    },
    "64":{
        "FLIGHT CREW SHORTAGE":" Sickness, awaiting stand-by, flight time limitations, crew meals, valid visa, and health documents etc."
    },
    "65":{
        "FLIGHT DECK CREW SPECIAL REQUEST":" Flight Deck’s – pilots – special request not within operational requirements"
    },
    "65a":{
        "Refueling refusal – training":" Must be used if headset is available for refueling and procedure is allowed but “refused” by flight crew due to training, extra briefing, etc."
    },
    "65b":{
"Refueling refusal – no explanation":" procedure is allowed but “refused” by flight crew without"
    },
    "65c":{
        "Other":" None of the cases above, explanation needed"
    },
    "66":{
        "LATE CABIN CREW BOARDING":""
    },
    "66a":{
        "Crew swap, long handover of duties":" Delay caused by long handover of duties and/or crew swap"
    },
    "66b":{
        "Security checks – training":" Late security check completion due to training purposes"
    },
    "66c":{
        "Other":" None of the cases above, explanation needed"
    },
    "67":{
        "CABIN CREW SHORTAGE":" Delay caused by insufficient number of cabin crewmembers onboard"
    },
    "67a":{
        "Awaiting stand by crew":" Delay caused by awaiting stand by crew"
    },
    "67b":{
        "Sickness":" Delay caused by (sudden) sickness of cabin crew"
    },
    "67c":{
        "Flight time limitations":" Delay caused by Flight and Duty time limitations of cabin crew member(s)"
    },
    "67d":{
        "Other":" None of the cases above, explanation needed"
    },
    "68":{
        "CABIN CREW ERROR OR SPECIAL REQUEST":" Delay caused by fault of cabin crew or special request "
    },
    "69":{
        "CAPTAIN REQUEST FOR SECURITY CHECK":" Captain’s request for extraordinary security check"
    },
    "71":{
        "DEPARTURE STATION":" Delayed caused by unfavorable weather of departure station. Code to be used when handling has been finished and the aircraft is ready for departure and waiting for weather improvement"
    },
    "71a":{
        "Low visibility":" Delay caused by low visibility at the departure airport"
    },
    "71b":{
        "Thunderstorm":" Delay caused by severe weather - thunderstorm - at the departure airport. No to be used if handling procedure was delayed due to weather (code 77)"
    },
    "71c":{
        "Snow, Braking action":" Delay caused by snow, contamination, poor or insufficient braking action at the departure airport"
    },
    "71d":{
        "Other":" None of the cases above, explanation needed"
    },
    "72":{
        "DESTINATION STATION":" Delayed caused by unfavorable weather of destination station"
    },
    "73":{
        "EN-ROUTE OR ALTERNATE":" Delayed caused by unfavorable weather en-route or at an alternate airport"
    },
    "75":{
        "DE-ICING OF AIRCRAFT":" Delay caused by the deicing of the aircraft. Removal of ice and/or snow, frost prevention. Excluding lack of/late/unserviceable equipment"
    },
    "75a":{
        "Deicing progress":" Deicing progress cannot be accomplished at the time of STD"
    },
    "75b":{
        "Waiting for Deicing in the queue":" Deicing cannot be accomplished immediately after doors closed due to number of aircrafts waiting in the queue for deicing"
    },
    "75c":{
        "Late deicing":" Deicing performed later than doors closed"
    },
    "75d":{
        "Refilling of trucks":" Delay caused by insufficient amount of deicing fluid in the deicing trucks. Refill needed"
    },
    "75e":{
        "Repeated Deicing due to expired Hold Over Time":" Deicing shall be repeated due to expired Hold Over Time before departure"
    },
    "76":{
        "Removal of snow, ice, water and sand from airport":" Delay caused by contamination removal from airport areas"
    },
    "77":{
        "Ground handling impaired by adverse weather conditions":" Delay caused by adverse weather conditions at the departure airport"
    },
    "77a":{
        "Airport / Handling limitations":" Delay caused by adverse weather conditions which have limitation on airport movements and/or handling services"
        },
        "77b":{
            "Aircraft / Airline limitations":" Delay caused by adverse weather conditions which have limitation on aircraft and/or airline performance"
        },
        "80":{
            "Missed ATC slot":" Delay caused by missed ATC slot"
        },
        "81":{
            "ATFM DUE TO ATC EN-ROUTE DEMAND/CAPACITY":" Delay caused by “standard” demand/capacity problems of ATC thus Slot time allocation"
        },
        "81a":{
            "Waiting for slot":" Slot is after STD"
        },
        "81b":{
            "Too short slot":" Time to “catch” CTOT is less then turnaround time. (e.g.aircraft late inbound)"
        },
        "81c":{
            "Slot not advised by Handling / ATC":" Slot time was not told to Flight Crew"
        },
        "82":{
            "ATFM DUE TO ATC STAFF/EQUIPMENT EN-ROUTE":" Delay caused by Slot time allocated due to ATC staff/equipment en-route, reduced capacity by industrial action or staff shortage or equipment failure, extraordinary demand due to capacity or reduction in neighboring area"
        },
        "83":{
            "ATFM DUE TO RESTRICTIONS AT DESTINATION AIRPORT":" Delay caused by Slot time allocated due to airport and/or runway closed due to obstruction, industrial action, staff shortage, political unrest, noise abatement, night curfew, special flights"
        },
        "84":{
            "ATFM DUE TO WEATHER AT DESTINATION":" Delay caused by Slot time allocated due to weather conditions at destination airport"
        },
        "85":{
            "MANDATORY SECURITY":" Delay caused by Mandatory security checks performed. If not all security lanes are manned. If all lanes are manned but delays still occur due to queues then code 87D is used. NOT to be used for offloading of missing passengers"
        },
        "85a":{
            "Congestion at security area":" Delay caused by congestion at the security area"
        },
        "85b":{
            "Terminal evacuation/limitation due to bomb/fire alarm":" Delay caused by mandatory security checks conducted due to bomb/fire alarm"
        },
        "85c":{
            "Other":" None of the cases above, explanation needed"
        },
        "86":{
            "IMMIGRATION, CUSTOMS, HEALTH":" Delay caused by governmental services"
        },
        "86a":{
            "Immigration":" Delay caused by authority needs/demands or lack of staff"
        },
        "86b":{
            "INAD":" Delay caused by handling inadmissible passenger(s)"
        },
        "86c":{
            "Insufficient travel documents":" Delay caused by insufficient travel documents of passengers"
        },
        "86d":{
            "Congestion at passport-control / boarder-police":" Delay caused by crowd formed at passport control-area"
        },
        "86e":{
            "Other":" None of the cases above, explanation needed"
        },
        "87":{
            "AIRPORT FACILITIES":" Delay caused by airport facilities: lack of/breakdown/congestion/etc"
        },
        "87a":{
            "Ramp congestion":" Crowded ramp, blockage of aircraft and/or GSE movements"
        },
        "87b":{
            "Lightings or buildings":" Delay caused by restrictions/limitations on lighting or buildings"
        },
        "87c":{
            "Jetbridge":" Jetbridge INOP or breakdown"
        },
        "87d":{
            "Congestion at security area":" Delay caused by congestion at security area despite all security lanes are open"
        },
        "88":{
            "RESTRICTIONS AT DESTINATION AIRPORT":" Delay caused by restrictions at destination airport"
        },
        "88a":{
            "Airport and/or runway closure":" Delay caused by airport and/or runway closure at the destination airport independently of being published or not, but known before departure"
        },
        "88b":{
            "Staff shortage/strike":" Delay caused by staff shortage/strike at destination station"
        },
        "88c":{
            "Night curfew":" Delay caused by night curfew at the destination station"
        },
        "88d":{
            "Other":" None of the cases above, explanation needed (e.g special flights, industrial action, political unrest, noise abatement, etc..)"
        },
        "89":{
            "RESTRICTIONS AT AIRPORT OF DEPARTURE WITH OR WITHOUT ATFM RESTRICTIONS":" Delay caused by restrictions at departure airport with or without ATFM restrictions: including Air Traffic Services, start up and push back, airport and/or runway closed due to obstruction or weather (restriction due to weather in case of ATFM regulation only, else refer to code 71), industrial action, staff shortage, political unrest, noise abatement, night curfew, special flights"
        },
        "89a":{
            "With ATFM restrictions":" Slot time allocated for departure due to airport facilities"
        },
        "89b":{
            "Without ATFM restrictions":" No slot time was allocated for departure, e.g taxiway limitations due to constructions"
        },
        "89c":{
            "Engine run-up restrictions":" Engine run-up restrictions on scheduled and on-time flights. (e.g specific stands, noise abattement, etc..)"
        },
        "91":{
            "LOAD CONNECTION":" Delay caused by awaiting load from another flight (deadload, co-mail, etc.)"
        },
        "92":{
            "THROUGH CHECK-IN ERROR":" Through check-in error of passenger and/or baggage"
        },
        "93":{
            "AIRCRAFT ROTATION/REACTIONARY":" Late arrival of incoming aircraft from previous sector"
        },
        "93a":{
            "Late departure":" Late arrival to destination due to late departure from origin station"
        },
        "93b":{
            "ATC procedure":" Late arrival due to ATC procedure during flight"
        },
        "93c":{
            "Holding":" Late arrival due to holding during flight"
        },
        "93d":{
            "Weather":" Late arrival due to weather during flight (e.g. flight path modification, holding, etc.)"
        },
        "93e":{
            "Technical":" Late arrival due to technical issues during flight"
        },
        "93f":{
            "Technical, Short ground time – income":" Short ground time - unable to perform the scheduled check due to late incoming of aircraft"
        },
        "94":{
            "CABIN CREW ROTATION":" Delay caused by awaiting Cabin Crew from another flight. Use 66A if long handover procedure"
        },
        "95":{
            "CREW ROTATION":" Delay caused by awaiting crew from another flight (Flight Deck or entire flight crew)"
        },
        "95a":{
            "Entire Crew":" Entire crew late due to rotation"
        },
        "95b":{
            "Flight Deck":" Only Flight Deck crew late due to rotation"
        },
        "96":{
            "OPERATIONS CONTROL":" Delay caused by Wizz Air operational decision. Re-routing, diversion, consolidation, aircraft change for reasons other than technical"
        },
        "96a":{
            "Diversion":" Diversion with no additional information from Wizz Air OPS"
        },
        "96b":{
            "Aircraft change":" Aircraft change due to operational reasons"
        },
        "96c":{
            "Diversion – operational":" Diversion for operational reasons"
        },
        "97":{
            "INDUSTRIAL ACTION WITHIN OWN AIRLINE":""
        },
        "98":{
            "INDUSTRIAL ACTION OUTSIDE OWN AIRLINE":""
        },
        "99":{
            "NOT ELSEWHERE SPECIFIED":" None of the delay codes/subcodes above, explanation needed"
        }
    }